errors = {
    "25": 'Невозможно добавить. Ваш список друзей переполнен.',
    "15": 'Невозможно добавить. Список друзей этого пользователя переполнен.',
    "40": 'Возникла ошибка при добавлении друга. Общение между вами и этим пользователем заблокировано.',
    "41": "Вы уже отправили заявку в друзья или недавно удалили данного пользователя из друзей.",
    "11": 'Вы добавили этого пользователя в чёрный список. Чтобы снова связаться с ним, откройте его профиль в сообществе Steam и удалите его из чёрного списка.',
    "84": 'Похоже, вы добавляете в друзья слишком много пользователей. Чтобы предотвратить спам, мы ограничили вам возможность добавлять друзей на некоторое время. Другие пользователи по-прежнему могут отправлять вам приглашения.',
    "24": "Ваш аккаунт не отвечает необходимым требованиям для использования этой функции. Подробности на сайте https://help.steampowered.com/ru/wizard/HelpWithLimitedAccount"
}